# GroupBy技术

In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'key1': ['a', 'a', 'b', 'b', 'a'],
                  'key2': ['one', 'two', 'one', 'two', 'one'],
                  'data1': np.random.randn(5),
                  'data2': np.random.randn(5)})

df

      data1     data2 key1 key2
0 -0.865074  0.400956    a  one
1 -0.732728 -0.111524    a  two
2  0.125021  0.954764    b  one
3 -0.548561 -0.136301    b  two
4  2.220107 -0.328614    a  one

In [3]:
grouped = df['data1'].groupby(df['key1'])

grouped

In [4]:
grouped.mean()

key1
a    0.207435
b   -0.211770
Name: data1, dtype: float64

In [5]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

means

key1  key2
a     one     0.677516
      two    -0.732728
b     one     0.125021
      two    -0.548561
Name: data1, dtype: float64

In [6]:
type(means)

pandas.core.series.Series

In [7]:
means.index

MultiIndex(levels=[['a', 'b'], ['one', 'two']],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['key1', 'key2'])

In [8]:
means.values

array([ 0.67751645, -0.73272761,  0.12502081, -0.54856057])

In [9]:
means.unstack()

key2       one       two
key1
a     0.677516 -0.732728
b     0.125021 -0.548561

In [10]:
states = np.array(['Ohio', 'California','California', 'Ohio', 'Ohio'])

years = np.array([2005, 2005, 2006, 2005, 2006])

df['data1'].groupby([states, years]).mean()

California  2005   -0.732728
            2006    0.125021
Ohio        2005   -0.706817
            2006    2.220107
Name: data1, dtype: float64

In [11]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.207435 -0.013060
b    -0.211770  0.409232

In [12]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.677516  0.036171
     two  -0.732728 -0.111524
b    one   0.125021  0.954764
     two  -0.548561 -0.136301

In [13]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

## 对分组进行迭代

In [14]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
      data1     data2 key1 key2
0 -0.865074  0.400956    a  one
1 -0.732728 -0.111524    a  two
4  2.220107 -0.328614    a  one
b
      data1     data2 key1 key2
2  0.125021  0.954764    b  one
3 -0.548561 -0.136301    b  two

In [15]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print(k1, k2)
    print(group)

a one
      data1     data2 key1 key2
0 -0.865074  0.400956    a  one
4  2.220107 -0.328614    a  one
a two
      data1     data2 key1 key2
1 -0.732728 -0.111524    a  two
b one
      data1     data2 key1 key2
2  0.125021  0.954764    b  one
b two
      data1     data2 key1 key2
3 -0.548561 -0.136301    b  two

In [16]:
for name, group in df.groupby(['key1', 'key2']):
    print(name)
    print(group)

('a', 'one')
      data1     data2 key1 key2
0 -0.865074  0.400956    a  one
4  2.220107 -0.328614    a  one
('a', 'two')
      data1     data2 key1 key2
1 -0.732728 -0.111524    a  two
('b', 'one')
      data1     data2 key1 key2
2  0.125021  0.954764    b  one
('b', 'two')
      data1     data2 key1 key2
3 -0.548561 -0.136301    b  two

In [17]:
pieces = dict(list(df.groupby('key1')))

pieces

{'a':       data1     data2 key1 key2
 0 -0.865074  0.400956    a  one
 1 -0.732728 -0.111524    a  two
 4  2.220107 -0.328614    a  one, 'b':       data1     data2 key1 key2
 2  0.125021  0.954764    b  one
 3 -0.548561 -0.136301    b  two}

In [18]:
pieces['b']

      data1     data2 key1 key2
2  0.125021  0.954764    b  one
3 -0.548561 -0.136301    b  two

In [19]:
type(pieces['b'])

pandas.core.frame.DataFrame

In [20]:
df.dtypes

data1    float64
data2    float64
key1      object
key2      object
dtype: object

In [21]:
grouped = df.groupby(df.dtypes, axis=1)

dict(list(grouped))

{dtype('float64'):       data1     data2
 0 -0.865074  0.400956
 1 -0.732728 -0.111524
 2  0.125021  0.954764
 3 -0.548561 -0.136301
 4  2.220107 -0.328614, dtype('O'):   key1 key2
 0    a  one
 1    a  two
 2    b  one
 3    b  two
 4    a  one}

## 选取一个或一组列

In [22]:
df.groupby('key1')['data1']

df.groupby('key1')['data2']

In [23]:
df['data1'].groupby(df['key1'])

df['data2'].groupby(df['key1'])

In [36]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one   0.562177
     two   0.409777
b    one  -1.264447
     two   0.882268

In [37]:
s_grouped = df.groupby(['key1', 'key2'])['data2']
s_grouped

In [38]:
s_grouped.mean()

key1  key2
a     one     0.562177
      two     0.409777
b     one    -1.264447
      two     0.882268
Name: data2, dtype: float64

## 通过字典或Series进行分组

In [42]:
people = pd.DataFrame(np.random.randn(5, 5),
                     columns = ['a', 'b', 'c', 'd', 'e'],
                     index = ['Joe', 'Steve','Wes', 'Jim', 'Travis'])

people

               a         b         c         d         e
Joe     1.457067  1.310873  0.743325  0.228995  1.792752
Steve  -0.149888  1.033253  1.147114  0.946738  0.001630
Wes    -2.831316  1.589821 -0.602367 -1.842164 -1.080976
Jim     1.178607 -1.207532  0.122847  1.441090  1.076962
Travis  0.890332  1.484727 -0.851553  0.274827  2.894197

In [43]:
people.iloc[2:3, 1:3] = np.nan

people

               a         b         c         d         e
Joe     1.457067  1.310873  0.743325  0.228995  1.792752
Steve  -0.149888  1.033253  1.147114  0.946738  0.001630
Wes    -2.831316       NaN       NaN -1.842164 -1.080976
Jim     1.178607 -1.207532  0.122847  1.441090  1.076962
Travis  0.890332  1.484727 -0.851553  0.274827  2.894197

In [44]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue',
          'd': 'blue', 'e': 'red', 'f': 'orange'}

In [45]:
by_column = people.groupby(mapping, axis=1)

dict(list(by_column))

{'blue':                c         d
 Joe     0.743325  0.228995
 Steve   1.147114  0.946738
 Wes          NaN -1.842164
 Jim     0.122847  1.441090
 Travis -0.851553  0.274827, 'red':                a         b         e
 Joe     1.457067  1.310873  1.792752
 Steve  -0.149888  1.033253  0.001630
 Wes    -2.831316       NaN -1.080976
 Jim     1.178607 -1.207532  1.076962
 Travis  0.890332  1.484727  2.894197}

In [46]:
by_column.sum()

            blue       red
Joe     0.972320  4.560692
Steve   2.093853  0.884995
Wes    -1.842164 -3.912292
Jim     1.563937  1.048036
Travis -0.576726  5.269256

In [47]:
map_series = pd.Series(mapping)

map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [48]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

## 通过函数进行分组

In [49]:
people

               a         b         c         d         e
Joe     1.457067  1.310873  0.743325  0.228995  1.792752
Steve  -0.149888  1.033253  1.147114  0.946738  0.001630
Wes    -2.831316       NaN       NaN -1.842164 -1.080976
Jim     1.178607 -1.207532  0.122847  1.441090  1.076962
Travis  0.890332  1.484727 -0.851553  0.274827  2.894197

In [50]:
people.groupby(len).sum()

          a         b         c         d         e
3 -0.195641  0.103340  0.866172 -0.172079  1.788737
5 -0.149888  1.033253  1.147114  0.946738  0.001630
6  0.890332  1.484727 -0.851553  0.274827  2.894197

In [51]:
key_list = ['one', 'one', 'one', 'two', 'two']

people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -2.831316  1.310873  0.743325 -1.842164 -1.080976
  two  1.178607 -1.207532  0.122847  1.441090  1.076962
5 one -0.149888  1.033253  1.147114  0.946738  0.001630
6 two  0.890332  1.484727 -0.851553  0.274827  2.894197

## 根据索引级别分组

In [53]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                    [1, 3, 5, 1, 3]], names=['cty', 'tenor'])

columns

MultiIndex(levels=[['JP', 'US'], [1, 3, 5]],
           labels=[[1, 1, 1, 0, 0], [0, 1, 2, 0, 1]],
           names=['cty', 'tenor'])

In [54]:
hier_df = pd.DataFrame(np.random.randn(4, 5), columns=columns)

hier_df

cty          US                            JP
tenor         1         3         5         1         3
0      0.309391  0.806614 -1.569213 -1.489085 -0.439413
1     -1.195926  1.134755 -0.616936 -0.867674  0.610664
2      0.854424 -1.172485  2.437067  0.150845 -0.491768
3      0.251035  0.376435 -0.697743  0.249242  1.099950

In [55]:
hier_df.groupby(level='cty', axis=1).count()

cty  JP  US
0     2   3
1     2   3
2     2   3
3     2   3